ERM/src/Documents/NoteAllocation.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Document>
		<Properties>
			<Name>NoteAllocation</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.BilledAR</xr:Item>
				<xr:Item>AccumulationRegister.UnallocatedMemo</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Source</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСоответствий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Invoice</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Invoice</v8:Type>
						<v8:Type>cfg:DocumentRef.Memo</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Location</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SubSubSegment</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сегменты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Account</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Lawson</v8:Type>
						<v8:Type>cfg:ChartOfAccountsRef.Oracle</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Currency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AU</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КостЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперацииNoteAllocation</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийNoteAllocation</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьMemo</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Memo</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ModifiedBy</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ModificationDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CreatedDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>CreditNotes</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>CreditNote</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Invoice</v8:Type>
								<v8:Type>cfg:DocumentRef.Memo</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Company</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Location</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>SubSubSegment</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сегменты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Account</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Lawson</v8:Type>
								<v8:Type>cfg:ChartOfAccountsRef.Oracle</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Currency</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>AU</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КостЦентры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Amount</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ERM/src/AccumulationRegisters/BilledAR.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<AccumulationRegister>
		<Properties>
			<Name>BilledAR</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Amount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>BaseAmount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Client</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Source</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСоответствий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Location</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>SubSubSegment</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сегменты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Invoice</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Invoice</v8:Type>
						<v8:Type>cfg:DocumentRef.Memo</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Account</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Lawson</v8:Type>
						<v8:Type>cfg:ChartOfAccountsRef.Oracle</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Currency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>AU</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КостЦентры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ERM/src/AccumulationRegisters/UnallocatedMemo.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<AccumulationRegister>
		<Properties>
			<Name>UnallocatedMemo</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Amount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>BaseAmount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Client</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Source</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСоответствий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Location</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>SubSubSegment</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сегменты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Memo</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Memo</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Account</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Lawson</v8:Type>
						<v8:Type>cfg:ChartOfAccountsRef.Oracle</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>AU</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КостЦентры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Currency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ERM/src/Documents/NoteAllocation/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура InvoiceПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Invoice) Тогда
			
		InvoiceПриИзмененииНаСервере();
		
		Если ЕстьAllocationПоДокументу(Объект.Invoice) Тогда
			Сообщить(" " + Объект.Invoice + " was previously credited.");
		КонецЕсли;
		
		RemainingInvoiceAmount = РассчитатьRemainingInvoiceAmount();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура InvoiceПриИзмененииНаСервере()
	
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Invoice, "Company, Location, SubSubSegment, Account, Currency, AU, Client, Amount");
	
	ЗаполнитьЗначенияСвойств(Объект, ЗначенияРеквизитов);
	
	РасчитатьДатуДокумента();
	InvoiceClient = ЗначенияРеквизитов.Client;
	InvoiceAmount = ЗначенияРеквизитов.Amount;
	
КонецПроцедуры

&НаКлиенте
Процедура CreditNotesCreditNoteПриИзменении(Элемент)
	
	ПустаяДата = Дата(1,1,1);
	ТекущиеДанные = Элементы.CreditNotes.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.CreditNote) Тогда
		
		//Если ТекущиеДанные = Неопределено Тогда
		//	Возврат;
		//КонецЕсли;
		
		Если ЕстьAllocationПоДокументу(ТекущиеДанные.CreditNote) Тогда
			Сообщить(" " + ТекущиеДанные.CreditNote + " was previously allocated.");
		КонецЕсли;
		
		ЗначенияРеквизитов = CreditNotesCreditNoteПриИзмененииНаСервере(ТекущиеДанные.CreditNote);
		
		ЗначенияРеквизитов.Amount = -ЗначенияРеквизитов.Amount;
		
		ЗаполнитьЗначенияСвойств(ТекущиеДанные, ЗначенияРеквизитов);
		
		RemainingInvoiceAmount = РассчитатьRemainingInvoiceAmount();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция CreditNotesCreditNoteПриИзмененииНаСервере(CreditNote)
	
	//Если Объект.ВидОперацииNoteAllocation = Перечисления.ВидыОперацийNoteAllocation.CreditNote Тогда
	//	Объект.Дата = CreditNote.Дата;
	//КонецЕсли;
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(CreditNote, "Company, Location, SubSubSegment, Account, Currency, AU, Amount, Дата");
	
	РасчитатьДатуДокумента(ЗначенияРеквизитов.Дата);
	
	Возврат ЗначенияРеквизитов;
	
КонецФункции

&НаСервере
Процедура РасчитатьДатуДокумента(ДатаCreditNote = Неопределено)
	
	Если ДатаCreditNote = Неопределено Тогда
		
		ДатаCreditNote = Дата(1,1,1);
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Invoice) Тогда
		
		InvoiceДата = Дата(1,1,1);
		
	Иначе
		
		InvoiceДата = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Invoice, "Дата");
		
	КонецЕсли;
	
	Объект.Дата = Макс(ДатаCreditNote, InvoiceДата);
	
	
КонецПроцедуры

&НаСервере
Функция РассчитатьRemainingInvoiceAmount()
	Сумма = Объект.Invoice.Amount;
	Для каждого СтрокаCreditNote Из Объект.CreditNotes Цикл
		Сумма = Сумма - СтрокаCreditNote.Amount;
	КонецЦикла;
	Возврат Сумма;
КонецФункции

&НаСервере
Функция ЕстьAllocationПоДокументу(Документ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	BilledARОбороты.Регистратор
		|ИЗ
		|	РегистрНакопления.BilledAR.Обороты(, , Регистратор, Invoice = &Документ) КАК BilledARОбороты
		|ГДЕ
		|	BilledARОбороты.Регистратор ССЫЛКА Документ.NoteAllocation
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	UnallocatedMemoОбороты.Регистратор
		|ИЗ
		|	РегистрНакопления.UnallocatedMemo.Обороты(, , Регистратор, Memo = &Документ) КАК UnallocatedMemoОбороты
		|ГДЕ
		|	UnallocatedMemoОбороты.Регистратор ССЫЛКА Документ.NoteAllocation";
	
	Запрос.УстановитьПараметр("Документ", Документ);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаBilledAR = РезультатЗапроса[0].Выбрать();
	ВыборкаUnallocatedMemo = РезультатЗапроса[1].Выбрать();
	
	Если ВыборкаBilledAR.Количество() <> 0 ИЛИ ВыборкаUnallocatedMemo.Количество() <> 0 Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ЗначениеЗаполнено(Объект.Invoice) Тогда
		RemainingInvoiceAmount = РассчитатьRemainingInvoiceAmount();
		InvoiceAmount = ПолучитьСуммуИнвойса();
	КонецЕсли;
	//ОпределитьВидимостьПолей();
КонецПроцедуры

&НаСервере
Функция ПолучитьСуммуИнвойса()
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Invoice, "Amount");

КонецФункции
//&НаКлиенте
//Процедура ОпределитьВидимостьПолей()
//	
//	Если Объект.ВидОперацииNoteAllocation = ПредопределенноеЗначение("Перечисление.ВидыОперацийNoteAllocation.ПустаяСсылка") Тогда
//		Объект.ВидОперацииNoteAllocation = ПредопределенноеЗначение("Перечисление.ВидыОперацийNoteAllocation.CreditNote");
//	КонецЕсли;
//	
//	Если Объект.ВидОперацииNoteAllocation = ПредопределенноеЗначение("Перечисление.ВидыОперацийNoteAllocation.CreditNote") Тогда
//		Элементы.ГруппаInvoice.Видимость = Истина;
//		Элементы.ГруппаMemo.Видимость = Ложь;
//	Иначе
//		Элементы.ГруппаInvoice.Видимость = Ложь;
//		Элементы.ГруппаMemo.Видимость = Истина;
//	КонецЕсли;
//	
//КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Invoice, "Company, Location, SubSubSegment, Account, Currency, AU, Client");
	//
	//InvoiceClient = ЗначенияРеквизитов.Client;
	
КонецПроцедуры

//&НаКлиенте
//Процедура ВидОперацииNoteAllocationПриИзменении(Элемент)
//	
//	ОпределитьВидимостьПолей();
//		
//КонецПроцедуры

//&НаСервере
//Процедура MemoПриИзмененииНаСервере()
//	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Memo, "Company, Location, SubSubSegment, Account, Currency, AU, Client");
//	
//	ЗаполнитьЗначенияСвойств(Объект, ЗначенияРеквизитов);
//	
//	InvoiceClient = ЗначенияРеквизитов.Client;
//КонецПроцедуры

//&НаКлиенте
//Процедура MemoПриИзменении(Элемент)
//	MemoПриИзмененииНаСервере();
//	
//	Если ЕстьAllocationПоДокументу(Объект.Memo) Тогда
//		Сообщить(" " + Объект.Memo + ") was previously credited.");
//	КонецЕсли;
//	
//	RemainingInvoiceAmount = РассчитатьRemainingInvoiceAmount();
//	
//КонецПроцедуры
